src/DataProcessors/ЗагрузкаИнвентаряИзФайла.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаИнвентаряИзФайла</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ЦеныИнвентаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныИнвентаря</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инвентарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инвентарь</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/ЗагрузкаИнвентаряИзФайла/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыбратьИЗагрузить(Команда)

    Оповещение = Новый ОписаниеОповещения("ВыбратьИЗагрузитьЗавершение", ЭтотОбъект);
    НачатьПомещениеФайла(Оповещение, , , Истина, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИЗагрузитьЗавершение(ПомещениеВыполнено, Адрес, ИмяВыбранногоФайла, ДопПараметры) Экспорт

    Если НЕ ПомещениеВыполнено Тогда
        Возврат;
    КонецЕсли;

    ИмяФайла  = ИмяВыбранногоФайла;
    Результат = ЗагрузитьНаСервере(Адрес);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗагрузитьНаСервере(Адрес)

    ДвоичныеДанные   = ПолучитьИзВременногоХранилища(Адрес);
    ИмяВременногоФайла = ПолучитьИмяВременногоФайла("csv");
    ДвоичныеДанные.Записать(ИмяВременногоФайла);

    Создано   = 0;
    Обновлено = 0;
    Ошибок    = 0;

    Чтение = Новый ЧтениеТекста(ИмяВременногоФайла, КодировкаТекста.UTF8);

    Попытка

        НомерСтроки = 0;
        Строка = Чтение.ПрочитатьСтроку();

        Пока Строка <> Неопределено Цикл

            НомерСтроки = НомерСтроки + 1;

            Если НЕ ПустаяСтрока(Строка) Тогда

                Части = СтрРазделить(Строка, ";", Истина);

                Если Части.Количество() < 2 Тогда
                    Ошибок = Ошибок + 1;
                    ЗаписьЖурналаРегистрации("ЗагрузкаИнвентаря",
                        УровеньЖурналаРегистрации.Предупреждение, , ,
                        СтрШаблон("Строка %1 пропущена: мало колонок", НомерСтроки));
                Иначе
                    Наименование     = СокрЛП(Части[0]);
                    ИнвентарныйНомер = СокрЛП(Части[1]);
                    Цена = ?(Части.Количество() > 2, Число(СтрЗаменить(СокрЛП(Части[2]), ",", ".")), 0);

                    Если ЗаписатьЭлемент(Наименование, ИнвентарныйНомер, Цена) Тогда
                        Создано = Создано + 1;
                    Иначе
                        Обновлено = Обновлено + 1;
                    КонецЕсли;
                КонецЕсли;

            КонецЕсли;

            Строка = Чтение.ПрочитатьСтроку();

        КонецЦикла;

    Исключение
        Чтение.Закрыть();
        УдалитьФайлы(ИмяВременногоФайла);
        ВызватьИсключение;
    КонецПопытки;

    Чтение.Закрыть();
    УдалитьФайлы(ИмяВременногоФайла);

    Возврат СтрШаблон("Создано: %1, обновлено: %2, пропущено с ошибкой: %3",
                     Создано, Обновлено, Ошибок);

КонецФункции

&НаСервереБезКонтекста
Функция ЗаписатьЭлемент(Наименование, ИнвентарныйНомер, Цена)

    ЭтоНовый = Ложь;

    НачатьТранзакцию();
    Попытка

        Ссылка = Справочники.Инвентарь.НайтиПоРеквизиту("ИнвентарныйНомер", ИнвентарныйНомер);

        Если Ссылка.Пустая() Тогда
            Элемент = Справочники.Инвентарь.СоздатьЭлемент();
            Элемент.ИнвентарныйНомер = ИнвентарныйНомер;
            ЭтоНовый = Истина;
        Иначе
            Элемент = Ссылка.ПолучитьОбъект();
        КонецЕсли;

        Элемент.Наименование = Наименование;
        Элемент.Записать();

        Если Цена > 0 Тогда
            НаборЗаписей = РегистрыСведений.ЦеныИнвентаря.СоздатьНаборЗаписей();
            НаборЗаписей.Отбор.Инвентарь.Установить(Элемент.Ссылка);
            НаборЗаписей.Отбор.Период.Установить(НачалоДня(ТекущаяДатаСеанса()));

            Запись = НаборЗаписей.Добавить();
            Запись.Период    = НачалоДня(ТекущаяДатаСеанса());
            Запись.Инвентарь = Элемент.Ссылка;
            Запись.Цена      = Цена;

            НаборЗаписей.Записать();
        КонецЕсли;

        ЗафиксироватьТранзакцию();

    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение;
    КонецПопытки;

    Возврат ЭтоНовый;

КонецФункции
